Spoke: smss-dogs-backup, Environment: prod and Pipeline Stage: Prod
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_backup_policy_vm.policy["daily-backup-policy-1"] will be created
  + resource "azurerm_backup_policy_vm" "policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "daily-backup-policy-1"
      + policy_type                    = "V2"
      + recovery_vault_name            = "rsv-smss-core-001"
      + resource_group_name            = "rg-smss-core-001"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "20:00"
        }

      + retention_daily {
          + count = 14
        }
    }

  # azurerm_backup_protected_vm.vm["vm-dogs-app01"] will be created
  + resource "azurerm_backup_protected_vm" "vm" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + source_vm_id        = "/subscriptions/becc4bf3-5028-43e4-8008-06e9362d6b86/resourceGroups/rg-smss-dogs-001/providers/Microsoft.Compute/virtualMachines/vm-dogs-app01"
    }

  # azurerm_backup_protected_vm.vm["vm-dogs-sql01"] will be created
  + resource "azurerm_backup_protected_vm" "vm" {
      + backup_policy_id    = (known after apply)
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-smss-core-001"
      + resource_group_name = "rg-smss-core-001"
      + source_vm_id        = "/subscriptions/becc4bf3-5028-43e4-8008-06e9362d6b86/resourceGroups/rg-smss-dogs-001/providers/Microsoft.Compute/virtualMachines/vm-dogs-sql01"
    }

Plan: 3 to add, 0 to change, 0 to destroy.